#### Importado y exportado de archivos csv

Primera parte del MySQL_MovieProject

In [1]:
import pandas as pd # Importamos las librerías
import numpy as np
import re
from datetime import datetime

In [2]:
pd.set_option('display.max_columns', None)  # ver todas las columnas

Tenemos un total de 7 csv's - Este notebook va a servir como plantilla para limpiar el primer csv y aplicar métodos parecidos al resto de ficheros .csv.
Los 7 .csv son los siguientes:
* actor.csv
* category.csv
* film.csv
* inventory.csv
* language.csv
* old_HDD.csv
* rental.csv

In [3]:
path = '../data/actor.csv'

actor = pd.read_csv(path)

actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

* Con estas primeras 5 filas podemos ver que la fecha en la que se actualizan los nombres de cada actor son iguales. 
* Voy a comprobar si la varianza en la columna es baja o si hay pocos valores únicos si son todos iguales me voy a deshacer de ella.

In [5]:
# Procedo a ver los valores únicos de la columna:
actor.last_update.unique()

array(['2006-02-15 04:34:33'], dtype=object)

* Solo hay un tipo de valor en toda la columna -> me la puedo quitar con total confianza -> no nos aporta nada saber que los datos de los actores se actualizaron todos el mismo día y a la misma hora

In [6]:
actor.drop(columns='last_update', inplace=True)
actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [7]:
actor.shape

(200, 3)

Tenemos 200 actores y 3 columnas después de habernos quitado el `last_update`

In [8]:
actor.isnull().sum() # Comprobamos si hay nulos

actor_id      0
first_name    0
last_name     0
dtype: int64

In [9]:
# Vamos a borrar duplicados si los hubiera:
actor.drop_duplicates(inplace=True)

In [12]:
actor.actor_id.unique().size

200

In [13]:
# Ahora sabemos que tenemos 200 valores unicos de actor_id pero con esto no podemos comprobar si hay algun first__name,last_name duplicado
# Vamos a comprobar esto:
nombres_dups = actor.duplicated(subset=['first_name', 'last_name'], keep='first') # creamos subset de solo nombre y apellido


actor = actor[~nombres_dups] # Con la virgulilla excluimos los duplicados


actor = actor.reset_index(drop=True) # Si se encontrara algún nombre repetido se borraría su indice así que vamos a resetearlos por si acaso

In [14]:
# Comprobamos el size una última vez para saber si se ha borrado alguna fila
actor.shape

(199, 3)

Se ha borrado una única fila - esto quiere decir que había un nombre-apellido repetido

In [15]:
# Pasamos el csv a nuestra carpeta data,llamándolo igual pero con un '_clean'
actor.to_csv('../data/actor_clean.csv', index=False)